Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Click the play icon.
it_it: Cliccare sull'icona di "play" [riproduzione].

source: Client code must hook various events and decide what to do when they are emitted (e.g. a click or double-click on a file).
it_it: Il codice client deve agganciare vari eventi e decidere cosa fare quando vengono generati (ad esempio, un clic o un doppio clic su un file).

source: Clip Corner Layers
it_it: Clipping degli Angoli del Layer

source: Clips the corners of the image with this radius.
it_it: Ritaglia gli angoli dell'immagine con questo raggio.

source: Clone Poky, meta-openembedded and meta-raspberrypi in the sources
it_it: Clonare Poky, meta-openembedded e meta-raspberrypi nei sorgenti

source: Clone mkttf
it_it: Clonare mkttf

source: Clone the NuttX and Apps repositories
it_it: Cloniamo i repository NuttX e Apps.es

source: Clone the ``alif_m55-lvgl`` Project
it_it: Clonare il Progetto ``alif_m55-lvgl``

source: Clone the ready-to-use `lv_port_renesas_rx72n-envision-kit <https://github.com/lvgl/lv_port_renesas_rx72n-envision-kit.git>`__ repository:
it_it: Clonare il repository già pronto `lv_port_renesas_rx72n-envision-kit <https://github.com/lvgl/lv_port_renesas_rx72n-envision-kit.git>`__:

source: Clone the ready-to-use repository for your board:
it_it: Clonare il repository pronto all'uso per la propria board:

source: Clone the ready-to-use repository for your selected board, for FSP version from 6.0 and above:
it_it: Clonare il repository pronto all'uso per la scheda selezionata, per versioni FSP dalla 6.0 in poi:

source: Clone the ready-to-use repository for your selected board, for FSP version prior to 6.0:
it_it: Clonare il repository pronto all'uso per la scheda selezionata, per versioni FSP precedenti alla 6.0:

source: Clone the ready-to-use repository for your selected board:
it_it: Clonare il repository pronto all'uso per la board selezionata:

source: Clone the ready-to-use repository:
it_it: Clonare il repository pronto all'uso:

source: Clone your forked repository.
it_it: Clonare il repository "forkato".

source: Close an opened image, and free the allocated resources.
it_it: Chiude un'immagine aperta e libera le risorse allocate.

source: Close the message box
it_it: Chiudere la finestra di messaggio

source: Code Blocks
it_it: Blocchi di Codice

source: Code export
it_it: Esportazione del codice

source: Code export follows some conventions.
it_it: L'esportazione del codice segue alcune convenzioni.

source: Code generation
it_it: Generazione del codice

source: Code generation with FSP
it_it: Generazione del codice con FSP

source: Code generation with SMC
it_it: Generazione del codice con SMC

source: Coding Guide
it_it: Guida alla Codifica

source: Coding Style
it_it: Stile di Codifica

source: Colibri Carrier Boards:
it_it: Schede Carrier Colibri:

source: Colibri Computer on Module:
it_it: Computer on Module Colibri:

source: Color (lv_color)
it_it: Colore (lv_color)

source: Color Depth (bits per pixel)
it_it: Profondità Colore (bit per pixel)

source: Color Depth: 16-bit
it_it: Profondità Colore: 16-bit

source: Color Format
it_it: Formato Colore

source: Color Format (how colors in pixels are laid out)
it_it: Formato Colore (come vengono visualizzati i colori in pixel)

source: Color Formats
it_it: Formati Colore

source: Color and Recoloring
it_it: Colore e Ricolorazione

source: Color format = RAW, output format = C Array
it_it: Formato colore = RAW, formato di output = C Array

source: Color format.
it_it: Formato colore

source: Color of selected characters.
it_it: Colore dei caratteri selezionati.

source: Color palettes are not supported.
it_it: Le "palette" [tavolozze] di colori non sono supportate.

source: Colored vector graphics cannot be rendered.
it_it: Non è possibile eseguire il rendering di grafica vettoriale colorata.

source: Colors: ``type="color(0xff0000 0x00ff00 0x0000ff)"``
it_it: Colori: ``type="color(0xff0000 0x00ff00 0x0000ff)"``

source: Column width can be set with :cpp:expr:`lv_table_set_column_width(table, col_id, width)`.
it_it: La larghezza delle colonne può essere impostata con :cpp:expr:`lv_table_set_column_width(table, col_id, width)`.

source: Combining ease of use with powerful features like containerization and over-the-air (OTA) updates, TorizonOS helps developers accelerate time-to-market while ensuring robust performance and security for embedded applications.
it_it: Combinando la facilità d'uso con potenti funzionalità come la containerizzazione e gli aggiornamenti over-the-air (OTA), TorizonOS aiuta gli sviluppatori ad accelerare il time-to-market, garantendo al contempo prestazioni e sicurezza elevate per le applicazioni embedded.

source: Comes with modules specifically for embedded systems, such as the `machine module <https://docs.micropython.org/en/latest/library/machine.html#classes>`__ for accessing low-level hardware (I/O pins, ADC, UART, SPI, I2C, RTC, Timers etc.)
it_it: Fornito con moduli specifici per sistemi embedded, come il `modulo "machine" <https://docs.micropython.org/en/latest/library/machine.html#classes>`__ per l'accesso all'hardware di basso livello (pin I/O, ADC, UART, SPI, I2C, RTC, timer ecc.)

source: Coming soon.
it_it: Prossimamente.

source: Command-Line Options
it_it: Opzioni della Riga di Comando

source: Commands
it_it: Comandi

source: Comments
it_it: Commenti

source: Comments add information about what you were thinking when the code was written, and **why** you did things that way---information that cannot be conveyed by the source code alone.
it_it: I commenti aggiungono informazioni su cosa si stava pensando quando è stato scritto il codice e **perché** sono state fatte le cose in quel modo, informazioni che non possono essere trasmesse dal solo codice sorgente.

source: Commit Message Format
it_it: Formato dei Messaggi di Commit

source: Commit and push your changes to your forked ``lvgl`` repository.
it_it: Eseguire il commit e il push delle modifiche nel proprio repository ``lvgl`` forkato.

source: Common Arguments
it_it: Argomenti Comuni

source: Common Thread Management Approaches
it_it: Approcci Comuni alla Gestione dei Thread

source: Common Widget Features
it_it: Funzionalità Comuni dei Widget

source: Common mistakes
it_it: Errori comuni

source: Compact
it_it: Compatto

source: Compare to ``"lvgl_type"`` This includes struct, union, integral types (e.g. int, unsigned int), etc..
it_it: Confrontare con ``"lvgl_type"``. Include struct, union, tipi interi (ad esempio int, unsigned int), ecc.

source: Compare to a reference tree:
it_it: Confronto con un albero di riferimento:

source: Compare two directories (presence + normalized content).
it_it: Confronta due directory (presenza + contenuto normalizzato).

source: Compared to image assets, XML files have a relatively small size even when the described UI is complex.
it_it: Rispetto alle risorse immagine, i file XML hanno dimensioni relativamente ridotte, anche quando l'interfaccia utente descritta è complessa.

source: Compatible
it_it: Compatibile

source: Compile (web or node) the runtime Binary for previewing or testing the UI:
it_it: Compilare (web o node) il Binario runtime per visualizzare in anteprima o testare l'interfaccia utente:

source: Compile LVGL for Arm
it_it: Compilare LVGL per Arm

source: Compile UI to HTML using **Emscripten**
it_it: Compilare l'interfaccia utente in HTML utilizzando **Emscripten**

source: Compile UIs to HTML (Emscripten)
it_it: Compilare le interfacce utente in HTML (Emscripten)

source: Compile for Node:
it_it: Compilazione per Node:

source: Compile for a target.
it_it: Compila per un target.

source: Compile the application
it_it: Compilare l'applicazione

source: Compile the application.
it_it: Compilare l'applicazione.

source: Complete details are available at :ref:`adding_lvgl_to_your_project`.
it_it: I dettagli completi sono disponibili in :ref:`adding_lvgl_to_your_project`.

source: Complex Menu
it_it: Menù complesso

source: Complex binding
it_it: Binding Complessi

source: Complex languages where subsequent characters combine into a single glyph and where the resulting glyph has no individual Unicode representation (e.g., Devanagari), have limited support in LVGL.
it_it: Le lingue complesse in cui i caratteri successivi si combinano in un unico glifo e in cui il glifo risultante non ha una rappresentazione Unicode individuale (ad esempio, il devanagari), hanno un supporto limitato in LVGL.

source: Component wrapper
it_it: Wrapper del componente

source: Components
it_it: Componenti

source: Components are one of the main building blocks for creating new UI elements.
it_it: I Componenti sono uno degli elementi fondamentali per la creazione di nuovi elementi dell'interfaccia utente.

source: Components can be built from Widgets and other Components
it_it: I Componenti possono essere creati a partire da Widget e altri Componenti

source: Compound types
it_it: Tipi composti

source: Compressed Fonts
it_it: Font Compressi

source: Compressed fonts also support ``bpp=3``.
it_it: I font compressi supportano anche ``bpp=3``.

source: Compressed fonts can be generated by
it_it: I font compressi possono essere generati

source: Compressing PNG Files
it_it: Compressione dei File PNG

source: Compression and Minification
it_it: Compressione e Minimizzazione

source: Compression is more effective with larger fonts and higher bpp.
it_it: La compressione è più efficace con font più grandi e un bpp più elevato.

source: Conclusion
it_it: Conclusione

source: Configurable antialiasing with multiple modes:
it_it: Antialiasing configurabile con più modalità:

source: Configuration Settings
it_it: Impostazioni di Configurazione

source: Configuration data acts as the glue to bind everything together.
it_it: I dati di configurazione fungono da collante per collegare tutto

source: Configurations
it_it: Configurazioni

source: Configure DRM Driver
it_it: Configurare il driver DRM

source: Configure GLFW Driver
it_it: Configurare il driver GLFW

source: Configure LVGL
it_it: Configurare LVGL

source: Configure NuttX to use the ``sim`` board and the LVGL Demo
it_it: Configurare NuttX per utilizzare la board ``sim`` e LVGL Demo

source: Configure NuttX to use the stm32f429i-disco board and the LVGL Demo
it_it: Configurare NuttX per utilizzare la scheda stm32f429i-disco e la demo LVGL

source: Configure OpenGL Driver
it_it: Configurare il driver OpenGL

source: Configure X11 driver
it_it: Configurare il driver X11

source: Configure positions in lv_conf.h:
it_it: Configura le posizioni in lv_conf.h:

source: Configure the Board Variant
it_it: Configurare la Variante della Board

source: Configuring Logging
it_it: Configurazione del Logging

source: Configuring the Driver
it_it: Configurazione del Driver

source: Configuring the PSRAM on ESP32 supported devices
it_it: Configurazione della PSRAM sui dispositivi supportati da ESP32

source: Configuring the driver
it_it: Configurazione del driver

source: Configuring the wayland driver
it_it: Configurazione del driver Wayland

source: Configuring ticks
it_it: Configurazione delle tacche

source: Configuring with cmake
it_it: Configurazione con cmake

source: Confirm the GPU initialization method, there are two ways:
it_it: Per confermare il metodo di inizializzazione della GPU, ci sono due modi:

source: Conforming to a known structure allows BitBake to make assumptions during builds on where to find types of metadata.
it_it: Conformarsi a una struttura nota consente a BitBake di fare ipotesi durante le build su dove trovare i tipi di metadati.

source: Conic Gradients
it_it: Gradienti Conici

source: Conical
it_it: Conico

source: Conical Gradient
it_it: Gradiente Conico

source: Connect an Ethernet cable to the RPi4 and ensure the laptop and the RPi4 are on the same network.
it_it: Collegare un cavo Ethernet al RPi4 e assicurarsi che il laptop e l'RPi4 siano sulla stessa rete.

source: Connect each group to its respective input device
it_it: Collegare ogni gruppo al rispettivo dispositivo di input

source: Connect the :ref:`display_interface`.
it_it: Collegare l':ref:`display_interface`.

source: Connect the :ref:`indev_interface`.
it_it: Collegare l':ref:`indev_interface`.

source: Connect the :ref:`tick_interface`.
it_it: Collegare l':ref:`tick_interface`.

source: Connect to ``PyCharm`` / ``VSCode`` / ``Eclipse (not supported yet)``
it_it: Connessione a ``PyCharm`` / ``VSCode`` / ``Eclipse (non ancora supportato)``

source: Connecting LVGL to Your Hardware
it_it: Collegamento di LVGL all'Hardware

source: Connecting to a Debugger
it_it: Connettersi al Debugger

source: Connectivity
it_it: Connettività

source: Consider HE when power usage is a concern.
it_it: Considerare HE quando il consumo energetico è un problema.

source: Consider minimizing LVGL CPU overhead by updating Widgets:
it_it: Si consiglia di ridurre al minimo il sovraccarico della CPU LVGL aggiornando i Widget:

source: Consider using the :ref:`lv_lottie` Widget instead.
it_it: Si consiglia di utilizzare il Widget :ref:`lv_lottie`.

source: Consider using the ``developing`` branch, which contains the latest updates.
it_it: Valutare la possibilità di utilizzare il branch ``developing``, che contiene gli aggiornamenti più recenti.

source: Considering an example structure using Zephyr with LVGL Editor:
it_it: Consideriamo una struttura di esempio utilizzando Zephyr con LVGL Editor:

source: Considering that some hardware has special requirements for image formats, such as alpha premultiplication and stride alignment, most image decoders (such as PNG decoders) may not directly output image data that meets hardware requirements.
it_it: Considerando che alcuni hardware hanno requisiti speciali per i formati immagine, come la premoltiplicazione alfa e la "stride alignment", la maggior parte dei decoder di immagini (come i decoder PNG) potrebbe non produrre direttamente dati immagine che soddisfano i requisiti hardware.

source: Console Tab
it_it: Scheda Console

source: Constant values can be referenced by ``#constant_name``.
it_it: I valori costanti possono essere referenziati tramite ``#constant_name``.

source: Constants
it_it: Costanti

source: Constants can be defined to replace any value with a selected type or to be used as special values.
it_it: Le costanti possono essere definite per sostituire qualsiasi valore con un tipo selezionato o per essere utilizzate come valori speciali.

source: Constants can be used in:
it_it: Le costanti possono essere utilizzate in:

source: Constraints on Redrawn Area
it_it: Vincoli sull'Area Ridisegnata

source: Contain Widgets and Components as children
it_it: Contenere Widget e Componenti come elementi figli

source: Container for the tabs: :ref:`base_widget`
it_it: Contenitore per le schede: :ref:`base_widget`

source: Contains a Renesas `configuration.xml` file in its root folder.
it_it: Contiene un file `configuration.xml` di Renesas nella sua cartella root.

source: Contains hooks from ``<widget_name>_gen.c`` and allows the user to write custom code.
it_it: Contiene hook da ``<widget_name>_gen.c`` e consente all'utente di scrivere codice personalizzato.

source: Contains private API and data for the Widget (overwritten on each code export)
it_it: Contiene API private e dati per il Widget (sovrascritti a ogni esportazione di codice)

source: Contains the generated API implementation of the Widget (overwritten on each code export)
it_it: Contiene l'implementazione API generata del Widget (sovrascritta a ogni esportazione di codice)

source: Contains the internals of the Widget, e.g., constructor with children, destructor, event handler, etc. (overwritten on each code export)
it_it: Contiene le componenti interne del Widget, ad esempio costruttore con elementi figlio, distruttore, gestore eventi, ecc. (sovrascritti a ogni esportazione di codice)

source: Content
it_it: Contenuto

source: Content Area (a :ref:`base_widget`) occupies the full width of the Background (its parent) the remainder of the available Background area below the Header.
it_it: La "Content Area" (un :ref:`base_widget`) occupa l'intera larghezza del Background (il suo elemento padre) e la parte rimanente dell'area del Background disponibile sotto l'Header.

source: Content Area on the background: :ref:`base_widget`
it_it: Content Area sul background: :ref:`base_widget`

source: Content of ``0001-change-config-file-to-run-fbdev-with-2-threads.patch``
it_it: Contenuto di ``0001-change-config-file-to-run-fbdev-with-2-threads.patch``

source: Content of ``0002-adapt-CMakeLists-file-to-compile-and-link-fbdev.patch``
it_it: Contenuto di ``0002-adapt-CMakeLists-file-to-compile-and-link-fbdev.patch``

source: Content of the tabs: :ref:`base_widget`
it_it: Contenuto delle schede: :ref:`base_widget`

source: Content, header, and footer: :ref:`base_widget`
it_it: Contenuto, intestazione e piè di pagina: :ref:`base_widget`

source: Contributor Covenant Code of Conduct
it_it: Codice di Condotta del Patto dei Collaboratori

source: Control File Explorer
it_it: File Explorer di Controllo

source: Control media playback with these functions:
it_it: La riproduzione multimediale si controlla con queste funzioni:

source: Control model animations with these functions:
it_it: Controllare le animazioni del modello con queste funzioni:

source: Controlling Animations
it_it: Controllare le Animazioni

source: Convert BDF to TTF
it_it: Convertire BDF in TTF

source: Convert the Unicode value to UTF8, for example on `this site <http://www.ltg.ed.ac.uk/~richard/utf-8.cgi?input=f287&mode=hex>`__.
it_it: Convertire il valore Unicode in UTF8, ad esempio su `questo sito <http://www.ltg.ed.ac.uk/~richard/utf-8.cgi?input=f287&mode=hex>`__.

source: Convert the font and copy the generated source code to your project.
it_it: Convertire il font e copiare il codice sorgente generato nel progetto.

source: Convert them to C code by using the Editor or the CLI
it_it: Convertendoli in codice C utilizzando l'editor o la CLI

source: Converter
it_it: Convertitore

source: Converting GIF Files to C Arrays
it_it: Conversione di File GIF in Array C

source: Converting GIF files to an array of bytes is not supported in the online image converter since LVGL v9.0.
it_it: La conversione di file GIF in un array di byte non è supportata dal convertitore di immagini online a partire dalla versione LVGL v9.0.

source: Converting JPEG to C array
it_it: Conversione di JPEG in array C

source: Coordinate System
it_it: Sistema di Coordinate

source: Coordinate translation applies after layout and affects scrollbars and ``LV_SIZE_CONTENT``.
it_it: La traslazione delle coordinate si applica dopo il layout e influisce sulle barre di scorrimento e su ``LV_SIZE_CONTENT``.

source: Coordinates are stored as style properties under the hood.
it_it: Le coordinate vengono memorizzate come proprietà di stile in modo automatico.

source: Copy ``Arm-2D/Library/Include/template/arm_2d_cfg.h`` to any location you prefer to provide the default configuration for Arm2D.
it_it: Copiare ``Arm-2D/Library/Include/template/arm_2d_cfg.h`` nella posizione che si preferisce per fornire la configurazione di default per Arm2D.

source: Copy its Unicode ID which is ``0xf287``.
it_it: Copiare il suo ID Unicode, che è ``0xf287``.

source: Copy or create the LVGL Editor Project inside ``src`` folder
it_it: Copiare o creare il progetto dell'editor LVGL all'interno della cartella ``src``

source: Copy read-only objects from Flash to PSRAM to increase speed.
it_it: Copiare oggetti di sola lettura dalla Flash alla PSRAM per aumentare la velocità.

source: Copy the FreeType source code to your project directory.
it_it: Copiare il codice sorgente di FreeType nella directory del progetto.

source: Copy the IP address that was assigned to the device by the DHCP server on your network.
it_it: Copiare l'indirizzo IP assegnato al dispositivo dal server DHCP sulla propria rete.

source: Copy this CMakeLists file to ``'your-project-directory'/components/rlottie/``
it_it: Copiare questo file CMakeLists in ``'your-project-directory'/components/rlottie/``

source: Copy-paste the block below into the file:
it_it: Copiare e incollare il blocco seguente nel file:

source: Core GStreamer framework
it_it: Framework GStreamer principale

source: Cortex-Debug (optional.
it_it: Cortex-Debug (facoltativo

source: Count down from the top (-1 = topmost).
it_it: Conta all'indietro dall'alto (-1 = più in alto).

source: Create **internal scripts or plugins** that help your own developers use or manage this Specification, as long as these are **not shared outside your organization or made publicly available**.
it_it: Creare **script o plugin interni** che aiutino i propri sviluppatori a utilizzare o gestire questa Specifica, a condizione che non vengano **condivisi all'esterno della propria organizzazione o resi pubblici**.

source: Create 4 input devices for the 4 channels
it_it: Creare 4 dispositivi di input per i 4 canali

source: Create Custom Image Font
it_it: Creare un Font Immagine Custom

source: Create Font Family
it_it: Creare una Famiglia di Font

source: Create Font from Font Manager
it_it: Creare Font da Font Manager

source: Create Fragment Class
it_it: Creare una Classe Fragment

source: Create FreeType Font
it_it: Creare un Font FreeType

source: Create RPi4 image
it_it: Creare un'immagine RPi4

source: Create Widgets by default on the right
it_it: Creare widget per impostazione di default a destra

source: Create a Barcode
it_it: Creare un Codice a Barre

source: Create a Menu
it_it: Creare un Menù

source: Create a Menu Page
it_it: Creare una Menu Page

source: Create a Menu container, section, separator
it_it: Creare un contenitore, una sezione e un separatore del Menù

source: Create a PR on GitHub from the page of your forked ``lvgl`` repository (``https://github.com/<YOUR_NAME>/lvgl``) by clicking the *"New pull request"* button.
it_it: Creare una PR su GitHub dalla pagina del proprio repository ``lvgl`` forkato (``https://github.com/<YOUR_NAME>/lvgl``) cliccando sul pulsante *"New pull request"*.

source: Create a QR Code
it_it: Creare un codice QR

source: Create a Window
it_it: Creazione di una Window

source: Create a ``#define`` string from the UTF8 values: ``#define MY_USB_SYMBOL "\xEF\x8A\x87"``
it_it: Creare una stringa ``#define`` dai valori UTF8: ``#define MY_USB_SYMBOL "\xEF\x8A\x87"``

source: Create a ``frogfs.yaml`` file inside.
it_it: Creare un file ``frogfs.yaml`` al suo interno.

source: Create a font with FreeType
it_it: Creare un font con FreeType

source: Create a frogfs blob
it_it: Creare un blob frogfs

source: Create a group for each channel
it_it: Creare un gruppo per ogni canale

source: Create a label and set the text.
it_it: Creare un'etichetta e impostare il testo.

source: Create a layer
it_it: Creare un layer

source: Create a message box
it_it: Creare una message box

source: Create a new file ``build.sh`` at the root of the project with this content:
it_it: Creare un nuovo file ``build.sh`` nella radice del progetto con questo contenuto:

source: Create a new project
it_it: Creare un nuovo progetto

source: Create a recipe
it_it: Creare una ricetta

source: Create a slider and write its value on a label
it_it: Creare uno slider e scriverne il valore su un'etichetta

source: Create a spinner
it_it: Creare uno Spinner

source: Create a window.
it_it: Creare una finestra.

source: Create an :cpp:type:`lv_draw_mask_rect_dsc_t` descriptor.
it_it: Creare un descrittore :cpp:type:`lv_draw_mask_rect_dsc_t`.
